docs/journal.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>journal</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org7bec0ef">
<div class="navbar-brand" id="orge16feed">
<div class="navbar-item" id="orgc726717">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org25680ac">
<div class="navbar-start" id="orge6e9e91">
<div class="navbar-item" id="org4db98fb">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org42f84f5">

</div>

</div>
</nav>

<div id="outline-container-org36aa3d3" class="outline-2">
<h2 id="org36aa3d3">2022</h2>
<div class="outline-text-2" id="text-org36aa3d3">
</div>
<div id="outline-container-orgfc6fb98" class="outline-3">
<h3 id="orgfc6fb98">2022-05 May</h3>
<div class="outline-text-3" id="text-orgfc6fb98">
</div>
<div id="outline-container-ID-69ce1b91-c7b2-4c2c-a92b-ad833b7d0b51" class="outline-4">
<h4 id="ID-69ce1b91-c7b2-4c2c-a92b-ad833b7d0b51">2022-05-26 Thursday</h4>
<div class="outline-text-4" id="text-orgac2ceaf">
</div>
<ul class="org-ul">
<li><a id="orgd584c0a"></a><span class="done DONE">DONE</span> change cabin air filter for 2017 f150-raptor ~21k miles <span class="timestamp-wrapper"><span class="timestamp">[2022-05-26 Thu 13:33]</span></span><br>
<div class="outline-text-5" id="text-orgd584c0a">
<p>
Steps (costs ~20$):
</p>
<ol class="org-ol">
<li>open glove box (can remove if more room needed)</li>
<li>pry plastic strip/hooks off across top of glove box/dash</li>
<li>take out the <b>7mm</b> bolts and pull back cover</li>
<li>pull off air filter cover by undoing the plastic clips</li>
<li>replace air filter in the proper direction</li>
</ol>
</div>
</li>
</ul>
</div>

<div id="outline-container-ID-3f606de1-9fe3-4cbd-82b4-47eebcb0a552" class="outline-4">
<h4 id="ID-3f606de1-9fe3-4cbd-82b4-47eebcb0a552">2022-05-27 Friday</h4>
<div class="outline-text-4" id="text-org3f96229">
</div>
<ul class="org-ul">
<li><a id="org7eafa4e"></a><span class="done DONE">DONE</span> change break pads front and back ~23k miles (rotated tires) <span class="timestamp-wrapper"><span class="timestamp">[2022-05-27 Fri 13:32]</span></span><br>
<div class="outline-text-5" id="text-org7eafa4e">
<ul class="org-ul">
<li>Uneven wearing on break pads drivers rear side was gone while rest had more than half left.</li>
<li>Did NOT spin balance/align but no issues thus far.</li>
</ul>
<p>
Steps (costs ~100$):
</p>
<ol class="org-ol">
<li>Jack from rear pumpkin/front skid plate and place jack stands (too tall for normal floor jacks)</li>
<li>Remove lug nuts then wheels with <b>21mm</b>
<ul class="org-ul">
<li>rotate tires front to back for even wear</li>
<li>torque to <b>100 psi</b> (calls for <b>150 psi</b>)</li>
</ul></li>
<li>remove caliper with <b>13mm</b>. Two bolts top and bottom on the back.
<ul class="org-ul">
<li>optionally grease caliper bolts</li>
</ul></li>
<li>use c-clap/screwdriver to spread caliper apart</li>
<li>place new brake pads and metal tabs (if provided)
<ul class="org-ul">
<li>used duralast gold cermanic front (<b>DG1414</b>) and back (<b>DG1790</b>)</li>
<li>optionally add break pad grease to the side of the pads</li>
</ul></li>
<li>pump breaks after reassembly to ensure pressure</li>
</ol>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-org5aece1f" class="outline-3">
<h3 id="org5aece1f">2022-07 July</h3>
<div class="outline-text-3" id="text-org5aece1f">
</div>
<div id="outline-container-ID-ef057b54-d9c4-4596-8b90-9cd483101fec" class="outline-4">
<h4 id="ID-ef057b54-d9c4-4596-8b90-9cd483101fec">2022-07-17 Sunday</h4>
<div class="outline-text-4" id="text-orgad79f2c">
</div>
<ul class="org-ul">
<li><a id="org76dd6d1"></a><span class="done DONE">DONE</span> oil change for 2017 f150-raptor ~23k miles <span class="timestamp-wrapper"><span class="timestamp">[2022-07-17 Sun 10:03]</span></span><br>
<div class="outline-text-5" id="text-org76dd6d1">
<p>
Steps (cost ~60$):
</p>
<ol class="org-ol">
<li>remove skid plate <b>10mm</b> (passenger side behind front wheel) for oil plug and drain
<ul class="org-ul">
<li>turn pull out then turn again for removal
<ul class="org-ul">
<li>plastic plug and pan
<ul class="org-ul">
<li>newer models have metal</li>
<li>mod kit available
<ul class="org-ul">
<li>chemical sealing is time sensitive on install</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
<li>remove skid plate (front drivers side) with <b>T-40</b> torx for oil filter drain</li>
<li>remove old filter with oil filter wrench and apply used oil to seal the new filter around edge
<ul class="org-ul">
<li><b>Fram PH10575</b> oil filter.
<ul class="org-ul">
<li>Alternatives: <b>Motorcraft F500-S</b>, <b>STP S10590</b>, <b>Mobile M1-212</b> (only one not used yet)</li>
</ul></li>
</ul></li>
<li>Add oil back with funnel
<ul class="org-ul">
<li><b>6 quarts</b> of <b>5W-30</b> synthetic pennzoil.</li>
</ul></li>
</ol>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org368cdd2" class="outline-3">
<h3 id="org368cdd2">2022-08 August</h3>
<div class="outline-text-3" id="text-org368cdd2">
</div>
<div id="outline-container-ID-58117d5b-95be-438f-938c-89b3cf2684c1" class="outline-4">
<h4 id="ID-58117d5b-95be-438f-938c-89b3cf2684c1">2022-08-01 Monday</h4>
<div class="outline-text-4" id="text-org2e4b669">
</div>
<ul class="org-ul">
<li><a id="orga59105d"></a><span class="done DONE">DONE</span> Investigate router rebooting often.<br>
<div class="outline-text-5" id="text-orga59105d">
<p>
Model: Netgear Nighthawk AX12 RAX 120v2
Firmware: 1.2.3.28
Reboots sporadically during day/night. More common when using streaming devices such as rokus/fire tvs.
Steps taken:
</p>
<ol class="org-ol">
<li>Added surface with airflow and reseat power connection</li>
<li>Disabled WMM(wifi multimedia) for 2.4 and 5 ghz under wmm tab on the Qos Setup page, to reduce load (speed is not the issue atm)</li>
<li>Went to hidden page <code>192.168.1.1/Thermal_FAN.htm</code> and verify the Fan temp sensor is  NaNC (broken) (set fan speed level?)</li>
<li>Went to hidden page <code>192.168.1.1/debug.htm</code> and enabled fan always</li>
<li>Returned the PoS and got a refund!</li>
</ol>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org53196f0" class="outline-2">
<h2 id="org53196f0">2023</h2>
<div class="outline-text-2" id="text-org53196f0">
</div>
<div id="outline-container-org4cc5f93" class="outline-3">
<h3 id="org4cc5f93">2023-07 July</h3>
<div class="outline-text-3" id="text-org4cc5f93">
</div>
<div id="outline-container-ID-1f164ab0-9f1e-4ca3-909f-0b8ba5113747" class="outline-4">
<h4 id="ID-1f164ab0-9f1e-4ca3-909f-0b8ba5113747">2023-07-15 Saturday</h4>
<div class="outline-text-4" id="text-org72bd49c">
</div>
<ul class="org-ul">
<li><a id="org39bf943"></a><span class="done DONE">DONE</span> oil change for 2017 f150-raptor 24350 miles <span class="timestamp-wrapper"><span class="timestamp">[2023-07-15 Sat 14:16]</span></span><br>
<div class="outline-text-5" id="text-org39bf943">
<ul class="org-ul">
<li>Fram filter again</li>
<li>add anti freeze/coolant (red/pink asian even tho ford calls for orange&#x2026;)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3a9439f" class="outline-2">
<h2 id="org3a9439f">2024</h2>
<div class="outline-text-2" id="text-org3a9439f">
</div>
<div id="outline-container-orgf76d7bc" class="outline-3">
<h3 id="orgf76d7bc">2024-04 April</h3>
<div class="outline-text-3" id="text-orgf76d7bc">
</div>
<div id="outline-container-ID-1abbac00-cfa7-40e3-8ca4-07f33506694c" class="outline-4">
<h4 id="ID-1abbac00-cfa7-40e3-8ca4-07f33506694c">2024-04-04 Thursday</h4>
<div class="outline-text-4" id="text-org4b278a4">
</div>
<ul class="org-ul">
<li><a id="orgb5093c7"></a><span class="done DONE">DONE</span> replace 2TB seagate <span class="timestamp-wrapper"><span class="timestamp">[2024-04-04 Thu 23:17]</span></span><br>
<div class="outline-text-5" id="text-orgb5093c7">
<ul class="org-ul">
<li>2TB 7200 rpm 256 MB cache</li>
<li>top left is old and still clicking along&#x2026;</li>
<li>2 from amazon on 2nd shelf.</li>
<li>top right from newegg</li>
<li>lost data from being unable to import pool after 'application data loss' from wear/scrub
<ul class="org-ul">
<li>formating the small partition caused error for zpool import</li>
<li>had to remove and regenerate zpool cache after reformatting partitions
<ul class="org-ul">
<li><code>zdb -l /dev/disk-by-id/</code> showed the labels intact and cachefile had wholedisk property still</li>
</ul></li>
</ul></li>
<li>forgot to add drive screws to trays self fasteners
<ul class="org-ul">
<li>labeled 'drive screws' for future use</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
